RT-Thread/rt-thread/bsp/swm320/libraries/SWM320_StdPeriph_Driver/SWM320_can.c
    CANx->FILTER.ACR[3] =  check1 & 0xFF;
    CANx->FILTER.ACR[2] = (check1 >>  8) & 0xFF;
    CANx->FILTER.ACR[1] =  check2 & 0xFF;
    CANx->FILTER.ACR[0] = (check2 >>  8) & 0xFF;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXNotEmptyEn()
* 功能说明: 当RX FIFO中有数据时（非空）触发中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTRXNotEmptyEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_RXDA_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXNotEmptyDis()
* 功能说明: 当RX FIFO中有数据时（非空）触发中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTRXNotEmptyDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_RXDA_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXNotEmptyStat()
* 功能说明: RX FIFO非空中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTRXNotEmptyStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_RXDA_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTTXBufEmptyEn()
* 功能说明: 当TX Buffer空时触发中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTTXBufEmptyEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_TXBR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTTXBufEmptyDis()
* 功能说明: 当TX Buffer空时触发中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTTXBufEmptyDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_TXBR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTTXBufEmptyStat()
* 功能说明: TX Buffer空中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTTXBufEmptyStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_TXBR_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrWarningEn()
* 功能说明: TXERR/RXERR计数值达到Error Warning Limit时触发中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTErrWarningEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_ERRWARN_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrWarningDis()
* 功能说明: TXERR/RXERR计数值达到Error Warning Limit时触发中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTErrWarningDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_ERRWARN_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrWarningStat()
* 功能说明: TXERR/RXERR计数值达到Error Warning Limit中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTErrWarningStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_ERRWARN_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXOverflowEn()
* 功能说明: RX FIFO 溢出时触发中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTRXOverflowEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_RXOV_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXOverflowDis()
* 功能说明: RX FIFO 溢出时触发中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTRXOverflowDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_RXOV_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXOverflowStat()
* 功能说明: RX FIFO 溢出中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTRXOverflowStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_RXOV_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTRXOverflowClear()
* 功能说明: RX FIFO 溢出中断清除
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTRXOverflowClear(CAN_TypeDef * CANx)
{
    CANx->CMD = (1 << CAN_CMD_CLROV_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTWakeupEn()
* 功能说明: 唤醒事件触发中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTWakeupEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_WKUP_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTWakeupDis()
* 功能说明: 唤醒事件触发中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTWakeupDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_WKUP_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTWakeupStat()
* 功能说明: 唤醒事件中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTWakeupStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_WKUP_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrPassiveEn()
* 功能说明: TXERR/RXERR计数值达到127时中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTErrPassiveEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_ERRPASS_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrPassiveDis()
* 功能说明: TXERR/RXERR计数值达到127时中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTErrPassiveDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_ERRPASS_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTErrPassiveStat()
* 功能说明: TXERR/RXERR计数值达到127中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTErrPassiveStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_ERRPASS_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTArbitrLostEn()
* 功能说明: 仲裁失败中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTArbitrLostEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_ARBLOST_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTArbitrLostDis()
* 功能说明: 仲裁失败中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTArbitrLostDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_ARBLOST_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTArbitrLostStat()
* 功能说明: 仲裁失败中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTArbitrLostStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_ARBLOST_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTBusErrorEn()
* 功能说明: 总线错误中断使能
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTBusErrorEn(CAN_TypeDef * CANx)
{
    CANx->IE |= (1 << CAN_IE_BUSERR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTBusErrorDis()
* 功能说明: 总线错误中断禁止
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void CAN_INTBusErrorDis(CAN_TypeDef * CANx)
{
    CANx->IE &= ~(1 << CAN_IE_BUSERR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: CAN_INTBusErrorStat()
* 功能说明: 总线错误中断是否触发
* 输    入: CAN_TypeDef * CANx    指定要被设置的CAN接口，有效值包括CAN
* 输    出: uint32_t          1 已触发    0 未触发
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t CAN_INTBusErrorStat(CAN_TypeDef * CANx)
{
    return (CANx->IF & CAN_IF_BUSERR_Msk) ? 1 : 0;
}
